mymy49/yss/STM32F103RB/NUCLEO-F103RB/ADC_EX/STM32F1xx/CMSIS/Device/Include/stm32f10x_cl.h
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x1400)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800)
#define USART4_BASE           (APB1PERIPH_BASE + 0x4C00)
#define USART5_BASE           (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800)
#define USB_FS_BASE           (APB1PERIPH_BASE + 0x5C00)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE             (APB1PERIPH_BASE + 0x6800)
#define BKP_BASE              (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)
#define DAC_BASE              (APB1PERIPH_BASE + 0x7400)

#define AFIO_BASE             (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE            (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE            (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE            (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE            (APB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE            (APB2PERIPH_BASE + 0x1800)
#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400)
#define ADC2_BASE             (APB2PERIPH_BASE + 0x2800)
#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)
#define USART1_BASE           (APB2PERIPH_BASE + 0x3800)

#define DMA1_BASE             (AHBPERIPH_BASE  + 0x0000)
#define DMA1_CH1_BASE         (AHBPERIPH_BASE  + 0x0008)
#define DMA1_CH2_BASE         (AHBPERIPH_BASE  + 0x001C)
#define DMA1_CH3_BASE         (AHBPERIPH_BASE  + 0x0030)
#define DMA1_CH4_BASE         (AHBPERIPH_BASE  + 0x0044)
#define DMA1_CH5_BASE         (AHBPERIPH_BASE  + 0x0058)
#define DMA1_CH6_BASE         (AHBPERIPH_BASE  + 0x006C)
#define DMA1_CH7_BASE         (AHBPERIPH_BASE  + 0x0080)
#define DMA2_BASE             (AHBPERIPH_BASE  + 0x0400)
#define DMA2_CH1_BASE         (AHBPERIPH_BASE  + 0x0408)
#define DMA2_CH2_BASE         (AHBPERIPH_BASE  + 0x041C)
#define DMA2_CH3_BASE         (AHBPERIPH_BASE  + 0x0430)
#define DMA2_CH4_BASE         (AHBPERIPH_BASE  + 0x0444)
#define DMA2_CH5_BASE         (AHBPERIPH_BASE  + 0x0458)
#define DMA2_CH6_BASE         (AHBPERIPH_BASE  + 0x046C)
#define DMA2_CH7_BASE         (AHBPERIPH_BASE  + 0x0480)
#define RCC_BASE              (AHBPERIPH_BASE  + 0x1000)
#define FLASH_BASE            (AHBPERIPH_BASE  + 0x2000)
#define CRC_BASE              (AHBPERIPH_BASE  + 0x3000)
#define ETH_BASE              (AHBPERIPH_BASE  + 0x8000)
#define OTG_FS_BASE           (APB1PERIPH_BASE + 0x10000000)
#define OTG_FS_DFIFO0_BASE    (APB1PERIPH_BASE + 0x10001000)
#define OTG_FS_DFIFO1_BASE    (APB1PERIPH_BASE + 0x10002000)
#define OTG_FS_DFIFO2_BASE    (APB1PERIPH_BASE + 0x10003000)
#define OTG_FS_DFIFO3_BASE    (APB1PERIPH_BASE + 0x10004000)
#define OTG_FS_DFIFO4_BASE    (APB1PERIPH_BASE + 0x10005000)
#define OTG_FS_DFIFO5_BASE    (APB1PERIPH_BASE + 0x10006000)
#define OTG_FS_DFIFO6_BASE    (APB1PERIPH_BASE + 0x10007000)
#define OTG_FS_DFIFO7_BASE    (APB1PERIPH_BASE + 0x10008000)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define TIM2                  ((TIM_GP_TypeDef *) TIM2_BASE    )
#define TIM3                  ((TIM_GP_TypeDef *) TIM3_BASE    )
#define TIM4                  ((TIM_GP_TypeDef *) TIM4_BASE    )
#define TIM5                  ((TIM_GP_TypeDef *) TIM5_BASE    )
#define TIM6                  ((TIM_B_TypeDef  *) TIM6_BASE    )
#define TIM7                  ((TIM_B_TypeDef  *) TIM7_BASE    )
#define RTC                   ((RTC_TypeDef    *) RTC_BASE     )
#define WWDG                  ((WWDG_TypeDef   *) WWDG_BASE    )
#define IWDG                  ((IWDG_TypeDef   *) IWDG_BASE    )
#define SPI2                  ((SPI_TypeDef    *) SPI2_BASE    )
#define SPI3                  ((SPI_TypeDef    *) SPI3_BASE    )
#define USART2                ((USART_TypeDef  *) USART2_BASE  )
#define USART3                ((USART_TypeDef  *) USART3_BASE  )
#define USART4                ((USART_TypeDef  *) USART4_BASE  )
#define USART5                ((USART_TypeDef  *) USART5_BASE  )
#define I2C1                  ((I2C_TypeDef    *) I2C1_BASE    )
#define I2C2                  ((I2C_TypeDef    *) I2C2_BASE    )
#define USB_FS                ((USB_FS_TypeDef *) USB_FS_BASE  )
#define CAN1                  ((CAN_TypeDef    *) CAN1_BASE    )
#define CAN2                  ((CAN_TypeDef    *) CAN2_BASE    )
#define BKP                   ((BKP_TypeDef    *) BKP_BASE     )
#define PWR                   ((PWR_TypeDef    *) PWR_BASE     )
#define DAC                   ((DAC_TypeDef    *) DAC_BASE     )
#define AFIO                  ((AFIO_TypeDef   *) AFIO_BASE    )
#define EXTI                  ((EXTI_TypeDef   *) EXTI_BASE    )
#define GPIOA                 ((GPIO_TypeDef   *) GPIOA_BASE   )
#define GPIOB                 ((GPIO_TypeDef   *) GPIOB_BASE   )
#define GPIOC                 ((GPIO_TypeDef   *) GPIOC_BASE   )
#define GPIOD                 ((GPIO_TypeDef   *) GPIOD_BASE   )
#define GPIOE                 ((GPIO_TypeDef   *) GPIOE_BASE   )
#define ADC1                  ((ADC_TypeDef    *) ADC1_BASE    )
#define ADC2                  ((ADC_TypeDef    *) ADC2_BASE    )
#define TIM1                  ((TIM_AC_TypeDef *) TIM1_BASE    )
#define SPI1                  ((SPI_TypeDef    *) SPI1_BASE    )
#define USART1                ((USART_TypeDef  *) USART1_BASE  )
#define DMA1                  ((DMA_TypeDef    *) DMA1_BASE    )
#define DMA1_CH1              ((DMA_CH_TypeDef *) DMA1_CH1_BASE)
#define DMA1_CH2              ((DMA_CH_TypeDef *) DMA1_CH2_BASE)
#define DMA1_CH3              ((DMA_CH_TypeDef *) DMA1_CH3_BASE)
#define DMA1_CH4              ((DMA_CH_TypeDef *) DMA1_CH4_BASE)
#define DMA1_CH5              ((DMA_CH_TypeDef *) DMA1_CH5_BASE)
#define DMA1_CH6              ((DMA_CH_TypeDef *) DMA1_CH6_BASE)
#define DMA1_CH7              ((DMA_CH_TypeDef *) DMA1_CH7_BASE)
#define DMA2                  ((DMA_TypeDef    *) DMA2_BASE    )
#define DMA2_CH1              ((DMA_CH_TypeDef *) DMA2_CH1_BASE)
#define DMA2_CH2              ((DMA_CH_TypeDef *) DMA2_CH2_BASE)
#define DMA2_CH3              ((DMA_CH_TypeDef *) DMA2_CH3_BASE)
#define DMA2_CH4              ((DMA_CH_TypeDef *) DMA2_CH4_BASE)
#define DMA2_CH5              ((DMA_CH_TypeDef *) DMA2_CH5_BASE)
#define DMA2_CH6              ((DMA_CH_TypeDef *) DMA2_CH6_BASE)
#define DMA2_CH7              ((DMA_CH_TypeDef *) DMA2_CH7_BASE)
#define RCC                   ((RCC_TypeDef    *) RCC_BASE     )
#define FLASH                 ((FLASH_TypeDef  *) FLASH_BASE   )
#define CRC                   ((CRC_TypeDef    *) CRC_BASE     )
#define ETH                   ((ETH_TypeDef    *) ETH_BASE     )
#define OTG_FS                ((OTG_FS_TypeDef *) OTG_FS_BASE  )
#define OTG_FS_DFIFO0         (((uint32_t      *) OTG_FS_DFIFO0_BASE)  )
#define OTG_FS_DFIFO1         (((uint32_t      *) OTG_FS_DFIFO1_BASE)  )
#define OTG_FS_DFIFO2         (((uint32_t      *) OTG_FS_DFIFO2_BASE)  )
#define OTG_FS_DFIFO3         (((uint32_t      *) OTG_FS_DFIFO3_BASE)  )
#define OTG_FS_DFIFO4         (((uint32_t      *) OTG_FS_DFIFO4_BASE)  )
#define OTG_FS_DFIFO5         (((uint32_t      *) OTG_FS_DFIFO5_BASE)  )
#define OTG_FS_DFIFO6         (((uint32_t      *) OTG_FS_DFIFO6_BASE)  )
#define OTG_FS_DFIFO7         (((uint32_t      *) OTG_FS_DFIFO7_BASE)  )
#define OB                    ((OB_TypeDef     *) OB_BASE      )

#endif
